# Data Wargling (Join)
# => # => (inner, outer, left, right)
# => df.join()
# => df.merge()
# => pd.concat()

# Group by
# => df.groupby(by)
# => unstact
# => pivot_Table

# Handling Missing Values

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=20),
                   "Account No":np.random.randint(1,5, size=(20))})

df1
#12345-1234567-3
#1234512345673

In [ ]:
df1[df1.duplicated()]

In [ ]:
a = df1.drop_duplicates()
print(len(a))
a

In [ ]:
a = df1.drop_duplicates(subset="CNIC")
print(len(a))
a

In [ ]:
a = df1.drop_duplicates(subset=["CNIC","Account No"], keep='last')
print(len(a))
a

In [37]:
size = 5000
df2 = pd.DataFrame({"CNIC": np.random.randint(1,size, size=(size)),
                   "Account No":np.random.randint(1,10, size=(size)),
                   "Mobile No":np.random.randint(2001,3000, size=(size)),
                  "DOB":pd.date_range('1690-01-01', periods=size, freq="M"),
                  "CustomerName":[chr(x) for x in np.random.randint(65,91, size=(size))],
                   "Gender":np.random.choice(["M","F"], size=(size)),
                   "Balance": np.random.randint(1,1000000, size=(size))})
df2.drop_duplicates(inplace=True)
print(len(df2))
df2

5000

      CNIC  Account No  Mobile No        DOB CustomerName Gender  Balance
0     4139           1       2458 1690-01-31            J      M   100998
1     2460           3       2241 1690-02-28            Z      F    26841
2     4811           1       2206 1690-03-31            W      F   820025
3       30           4       2179 1690-04-30            H      M   955755
4     4833           5       2651 1690-05-31            R      F   996303
...    ...         ...        ...        ...          ...    ...      ...
4995  2021           9       2239 2106-04-30            E      F   646860
4996  4445           5       2745 2106-05-31            N      F   249205
4997  1860           2       2232 2106-06-30            G      F   307278
4998    13           6       2662 2106-07-31            Z      M   235394
4999  3489           2       2169 2106-08-31            L      F   312192

[5000 rows x 7 columns]

In [ ]:
a = pd.DataFrame(df2.Gender.value_counts())
a

In [ ]:
b=df2.groupby(df2.Gender)[['Balance']].agg(['sum'])
b

In [ ]:
a.merge(b,left_index=True, right_index=True)

In [ ]:
print(df1.dtypes, df2.dtypes, sep="\n\n\n")

columnNameSameInBothDataframes
Name(optional), datatype, data_pattern

#data_frame_left.merge(dataframe_right, 
    on="columnNameSameInBothDataframes", 
    how="typeofJoin")
#typeofJoin=inner,outer,left,right

#dataframe_right.merge(data_frame_left, on=[col1,col2,col3], how="typeofJoin")

#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

#if columns name differents in both table 

#data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")

#data_frame_left.merge(dataframe_right, left_index=True, right_index=True, how='outer')

#### data_frame_left.merge(dataframe_right, on="columnNameSameInBothDataframes", how="typeofJoin")

In [ ]:
a = df1.merge(df2, on="CNIC", how='inner')
print(len(a))
a

### data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

In [ ]:
a = df1.merge(df2, on=["CNIC","Account No"], how="inner") #Join with multiples columns
a

##### data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")

In [ ]:
df1.columns

In [ ]:
df1.columns = ['Customer CNIC', 'Customer Account No']
df1.head(2)

In [ ]:
df2.head(2)

In [ ]:
a = df1.merge(df2, left_on="Customer CNIC", right_on="CNIC")
a

In [ ]:
a = df1.merge(df2, left_on=["Customer CNIC","Customer Account No"], right_on=["CNIC","Account No"])
a

##### data_frame_left.merge(dataframe_right, left_index=True, right_index=True, how='outer')

In [ ]:
customers = pd.DataFrame({"Customers NIC": [14,6,19,22],"Customer Name":["A","B","C","D"]})


transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(20)),
                   "TransactionID":np.random.randint(1,2, size=(20)),
                  "Transaction Date":pd.date_range('1990-01-01', periods=20, freq="M"),
                   "Description":np.random.choice(["TopUP","IBFT","FT"], size=(20)),
                            "Amount":np.random.randint(1,1000000, size=(20))})


customers

In [ ]:
transactions

In [ ]:
c = transactions.CNIC.value_counts()
print(c.index)
print(c.values)
print()
print(c)

In [ ]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='left')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

In [ ]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='right')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

In [ ]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='inner')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

In [ ]:
a = customers.merge(c, left_on="Customers NIC", right_index=True, how='outer')
a.columns = ['Customers NIC', 'Customer Name', 'Transaction counts']
a

In [ ]:
#Checkpoint 4-5-2021

# Slabs
* pd.cut(series)
* pd.qcut(series)

In [42]:
size = 5000
df2 = pd.DataFrame({"CNIC": np.random.randint(1,size, size=(size)),
                   "Account No":np.random.randint(1,10, size=(size)),
                   "Mobile No":np.random.randint(2001,3000, size=(size)),
                  "DOB":pd.date_range('1690-01-01', periods=size, freq="M"),
                  "CustomerName":[chr(x) for x in np.random.randint(65,91, size=(size))],
                   "Gender":np.random.choice(["M","F"], size=(size)),
                   "Balance": np.random.randint(1,1000000, size=(size))})
df2.drop_duplicates(inplace=True)
print(len(df2))
df2

5000

      CNIC  Account No  Mobile No        DOB CustomerName Gender  Balance
0     3865           2       2007 1690-01-31            A      F   118908
1       63           9       2215 1690-02-28            H      F   673862
2     3682           4       2858 1690-03-31            S      F   432704
3       18           2       2878 1690-04-30            J      M   152078
4       49           2       2208 1690-05-31            M      M   404261
...    ...         ...        ...        ...          ...    ...      ...
4995  3356           6       2418 2106-04-30            D      F   300524
4996   634           8       2462 2106-05-31            W      M   574176
4997  2229           6       2493 2106-06-30            A      F   116475
4998  3200           4       2378 2106-07-31            S      M   804753
4999  2069           1       2008 2106-08-31            Z      F   324007

[5000 rows x 7 columns]

In [39]:
def slab(amount):
    # This function return charges of transation depends on prices on range
    if amount >= 1000000:
        return 60
    elif amount >= 500000:
        return 55
    elif amount >= 300000:
        return 50
    elif amount >= 100000:
        return 45
    elif amount >= 50000:
        return 40
    elif amount >= 20000:
        return 35
    elif amount >= 10000:
        return 30
    elif amount >= 5000:
        return 25
    elif amount >= 1000:
        return 20
    else:
        return 0

In [43]:
df2['slabOne'] = df2['Balance'].apply(slab)

In [44]:
df2.slabOne.value_counts()

55    2527
45    1016
50     948
40     240
35     158
30      50
25      31
20      23
0        7
Name: slabOne, dtype: int64

In [45]:
transactions.head(2)

   CNIC  TransactionID Transaction Date Description  Amount     City
0     6              1       1990-01-31          FT  621605   Lahore
1    21              1       1990-02-28       TopUP  861354  Karachi

In [46]:
slabs = [1,1000,5000,10000,20000,50000,100000,300000,500000,1000000,100000000]
slabs

[1,
 1000,
 5000,
 10000,
 20000,
 50000,
 100000,
 300000,
 500000,
 1000000,
 100000000]

In [47]:
pd.cut(df2['Balance'],slabs)

0        (100000, 300000]
1       (500000, 1000000]
2        (300000, 500000]
3        (100000, 300000]
4        (300000, 500000]
              ...
4995     (300000, 500000]
4996    (500000, 1000000]
4997     (100000, 300000]
4998    (500000, 1000000]
4999     (300000, 500000]
Name: Balance, Length: 5000, dtype: category
Categories (10, interval[int64]): [(1, 1000] < (1000, 5000] < (5000, 10000] < (10000, 20000] ... (100000, 300000] < (300000, 500000] < (500000, 1000000] < (1000000, 100000000]]

In [48]:
pd.cut(df2['Balance'],slabs).value_counts()

(500000, 1000000]       2527
(100000, 300000]        1016
(300000, 500000]         948
(50000, 100000]          240
(20000, 50000]           158
(10000, 20000]            50
(5000, 10000]             31
(1000, 5000]              23
(1, 1000]                  7
(1000000, 100000000]       0
Name: Balance, dtype: int64

In [49]:
pd.cut(df2['Balance'],slabs,labels=[0,20,25,30,35,40,45,50,55,60]).value_counts()

55    2527
45    1016
50     948
40     240
35     158
30      50
25      31
20      23
0        7
60       0
Name: Balance, dtype: int64

In [54]:
slabs = [0,.5,.8,.95,1]
slabs

[0, 0.5, 0.8, 0.95, 1]

In [58]:
pd.qcut(df2['Balance'],slabs).value_counts()

(133.999, 506124.0]      2500
(506124.0, 803121.4]     1500
(803121.4, 947264.65]     750
(947264.65, 999961.0]     250
Name: Balance, dtype: int64

In [59]:
pd.qcut(df2['Balance'],slabs).value_counts()/5000*100

(133.999, 506124.0]      50.0
(506124.0, 803121.4]     30.0
(803121.4, 947264.65]    15.0
(947264.65, 999961.0]     5.0
Name: Balance, dtype: float64

In [ ]:
slabs = [0, 0.6, 0.8, .95, 1]
pd.qcut(transactions.Amount,slabs).value_counts()

# Group by

In [ ]:
#dataframeName.groupby("Col").agg([count])             optional(min,max,avg,sum, std)(int,float)
#dataframeName.groupby(by="Col")[["colname"]].agg([count]) 
#dataframeName.groupby(by=[col1,col2,..]).agg([count])

In [68]:
data_size = 5000
transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(data_size)),
                   "TransactionID":np.random.randint(1,2, size=(data_size)),
                  "Transaction Date":pd.date_range('1690-01-01', periods=data_size, freq="M"),
                   "Description":np.random.choice(["TopUP","IBFT","FT"], size=(data_size)),
                            "Amount":np.random.randint(1,1000000, size=(data_size)),
                            "City":np.random.choice(["Karachi","Islamabad","Lahore"], size=(data_size))})



transactions

      CNIC  TransactionID Transaction Date Description  Amount       City
0       14              1       1690-01-31       TopUP  672500     Lahore
1       19              1       1690-02-28        IBFT  352565  Islamabad
2       19              1       1690-03-31          FT  356680    Karachi
3        6              1       1690-04-30       TopUP  681237     Lahore
4       14              1       1690-05-31       TopUP  774639    Karachi
...    ...            ...              ...         ...     ...        ...
4995    19              1       2106-04-30          FT  328222    Karachi
4996    14              1       2106-05-31          FT   17690    Karachi
4997     6              1       2106-06-30       TopUP  325345  Islamabad
4998    21              1       2106-07-31       TopUP  228715     Lahore
4999     6              1       2106-08-31       TopUP  826929  Islamabad

[5000 rows x 6 columns]

In [61]:
a = transactions.groupby("City").agg(['count'])
a

           CNIC TransactionID Transaction Date Description Amount
          count         count            count       count  count
City
Islamabad     5             5                5           5      5
Karachi       7             7                7           7      7
Lahore        8             8                8           8      8

In [62]:
transactions.groupby("City")

In [63]:
a = transactions.groupby("City")[["CNIC"]].agg(['count'])
a

           CNIC
          count
City
Islamabad     5
Karachi       7
Lahore        8

In [64]:
a = transactions.groupby("City")[["City"]].agg(['count'])
a

           City
          count
City
Islamabad     5
Karachi       7
Lahore        8

In [65]:
#a = transactions.groupby(["City"])[['Amount']].agg(['count',min,max, np.mean, np.std])
a = transactions.groupby(["City"]).Amount.agg(['count',min,max, np.mean, np.std])
a

           count     min     max           mean            std
City
Islamabad      5  404094  646869  487450.400000   99595.454981
Karachi        7   91882  888194  402248.857143  280736.446701
Lahore         8   30613  952009  467462.750000  334848.078327

In [66]:
a = transactions.groupby(["City","Description"]).Amount.agg(['count',min,max, np.mean, np.std])
a

                       count     min     max           mean            std
City      Description
Islamabad FT               3  404094  646869  504004.666667  126959.396133
          IBFT             2  410733  514505  462619.000000   73377.884897
Karachi   FT               3  248260  888194  584380.666667  321187.957323
          TopUP            4   91882  427079  265650.000000  175500.548875
Lahore    IBFT             2   30613  952009  491311.000000  651525.359758
          TopUP            6   79747  861041  459513.333333  267903.235180

Categorical data/nominal data
'orange','mango'


ordinal data
1,3,2,4 (discreate/countinues)
A,B,C
a,b,c
i,ii,iii

In [ ]:
a = input("Enter no")
a.split("")

In [ ]:
list(str(232))

In [ ]:
transactions.groupby([transactions['Transaction Date'].dt.year, "City","CNIC"]).agg(['count'])